[
    {
        "Title": "Solitaire-Chess Game",
        "Classification": "Application",
        "Image": "/Application/SolitaireChessGame.png",
        "Promotional": [
            "A Game Combining Go and Solitaire.",
            "兼具圍棋及接龍的遊戲。"
        ],
        "Description": [
            "Gameplay:",
            "1. First, guess the randomly generated number. The random number is converted into binary, and you must predict the number of non-zero bits.",
            "2. If your guess is correct, you can place a piece on the board in a position of your choice.",
            "3. If your guess is incorrect, the app will place a piece to block your solitaire path.",
            "4. The goal is to connect to all four edges of the board to win!",
            "遊戲方法為:",
            "先猜測亂數問題,將亂數化成二進位制,猜測非0位數的數目。",
            "若猜對,則選擇您欲下子的位置下子。",
            "若猜錯,則由app下子圍堵您的接龍。",
            "接龍以觸及四週邊界為勝!"
        ]
    },
    {
        "Title": "Voxel Reconstruct",
        "Classification": "Application",
        "Image": "/Application/VoxelReconstruct.png",
        "Promotional": [
            "Assemble a large cube using building blocks of different arrangements and colors.",
            "利用不同排列及顏色的積木組裝成一個大立方體。"
        ],
        "Description": [
            "There are 729 unit cubes that together form a large 9 x 9 x 9 cube.",
            "Each small cube is colored based on its distance from the center of the large cube (rounded down to the nearest integer), with a gradient ranging from cool to warm colors.",
            "From the outer layers, 10 connected cubes are removed at a time, for a total of 51 removals. What remains is an irregular but connected cluster of 219 cubes at the very center.",
            "Each set of 10 removed cubes is uniquely shaped and colored—no two are the same in both form and color pattern.",
            "Game Rule: Use the 51 pieces as building blocks to reassemble the structure. During assembly, no isolated clusters or hollow spaces are allowed.",
            "有一單位立方體共729顆,可以組成9x9x9的大立方體。",
            "而小立方體的顏色安排是依小立方體中央距離大立方體中央的距離去除小數，給予一個顏色（由寒色系至暖色系）。",
            "從週邊挖除10個相連接小立方體,共挖了51次。僅留下正中央不規則且相連的219個小立方體!",
            "每次挖10顆的小立方體之排列的「形狀及顏色」,均不相同！",
            "遊戲規則:積木組裝此51個零件,組裝過程不得形成孤島及空穴。"
        ]
    },
    {
        "Title": "NuNu",
        "Classification": "High-Mountain Tea",
        "Image": "/HighMountainTea/IntoxicatedChild.png",
        "Promotional": [
            "--",
            "--"
        ],
        "Description": [
            "--",
            "--"
        ]
    }
]