[
    {
        "Title": "Solitaire-Chess Game",
        "URL": "https://apps.apple.com/app/id6742809581",
        "Classification": "Application",
        "Image": "/Application/SolitaireChessGame.png",
        "Promotional": [
            "A Game Combining Go and Solitaire.",
            "兼具圍棋及接龍的遊戲。"
        ],
        "Description": [
            "Gameplay:",
            "1. First, guess the randomly generated number. The random number is converted into binary, and you must predict the number of non-zero bits.",
            "2. If your guess is correct, you can place a piece on the board in a position of your choice.",
            "3. If your guess is incorrect, the app will place a piece to block your solitaire path.",
            "4. The goal is to connect to all four edges of the board to win!",
            "遊戲方法為:",
            "先猜測亂數問題,將亂數化成二進位制,猜測非0位數的數目。",
            "若猜對,則選擇您欲下子的位置下子。",
            "若猜錯,則由app下子圍堵您的接龍。",
            "接龍以觸及四週邊界為勝!"
        ]
    },
    {
        "Title": "Voxel Reconstruct",
        "URL": "https://apps.apple.com/app/id6745428136",
        "Classification": "Application",
        "Image": "/Application/VoxelReconstruct.png",
        "Promotional": [
            "Assemble a large cube using building blocks of different arrangements and colors.",
            "利用不同排列及顏色的積木組裝成一個大立方體。"
        ],
        "Description": [
            "There are 729 unit cubes that together form a large 9 x 9 x 9 cube.",
            "Each small cube is colored based on its distance from the center of the large cube (rounded down to the nearest integer), with a gradient ranging from cool to warm colors.",
            "From the outer layers, 10 connected cubes are removed at a time, for a total of 51 removals. What remains is an irregular but connected cluster of 219 cubes at the very center.",
            "Each set of 10 removed cubes is uniquely shaped and colored—no two are the same in both form and color pattern.",
            "Game Rule: Use the 51 pieces as building blocks to reassemble the structure. During assembly, no isolated clusters or hollow spaces are allowed.",
            "有一單位立方體共729顆,可以組成9x9x9的大立方體。",
            "而小立方體的顏色安排是依小立方體中央距離大立方體中央的距離去除小數，給予一個顏色（由寒色系至暖色系）。",
            "從週邊挖除10個相連接小立方體,共挖了51次。僅留下正中央不規則且相連的219個小立方體!",
            "每次挖10顆的小立方體之排列的「形狀及顏色」,均不相同！",
            "遊戲規則:積木組裝此51個零件,組裝過程不得形成孤島及空穴。"
        ]
    },
    {
        "Title": "Sudoku Reverie",
        "URL": "https://apps.apple.com/app/id6746757206",
        "Classification": "Application",
        "Image": "/Application/SudokuReverie.png",
        "Promotional": [
            "Train your brain with classic Sudoku!",
            "用經典數獨訓練你的大腦！"
        ],
        "Description": [
            "Sudoku Rules and Features, Game Objective",
            "   Fill the 9x9 grid with numbers so that:",
            "      • Each row",
            "      • Each column",
            "      • Each 3x3 subgrid (commonly referred to as a “box”) contains all digits from 1 to 9 exactly once.",
            "   Board Structure:",
            "      • The entire board consists of 9 rows X 9 columns, totaling 81 cells.",
            "      • The board is divided into 9 fixed 3x3 boxes (subgrids).",
            "      • Each 3x3 box contains 9 individual cells.",
            "數獨規則說明, 遊戲目標：",
            "   在一個 9x9 的方格中填入數字，使得：",
            "      • 每一列(Row)",
            "      • 每一欄(Column)",
            "      • 每一個 3x3 的固定小區（稱為「九宮格」）都恰好包含一次數字 1 到 9。",
            "   棋盤結構：",
            "      • 整個棋盤為: 9 列 X 9 欄，共 81 格。",
            "      • 被劃分為 9 個固定小區的 3x3 九宮格區域。",
            "      • 每個固定小區中的九宮格，包含 9 個格子。"
        ]
    },
    {
        "Title": "Celestial Chess",
        "URL": "https://apps.apple.com/app/id6746757206",
        "Classification": "Application",
        "Image": "/Application/CelestialChess.png",
        "Promotional": [
            "Unbound by rules, yet still drawn into the game.",
            "縱然不知對弈規則,亦可與之對弈。"
        ],
        "Description": [
            "Chinese Xiangqi, also known simply as Chinese Chess, is a time-honored two-player strategy game deeply rooted in Chinese culture. With a history spanning thousands of years, it reflects the profound influence of ancient military thought and tactical wisdom. The board consists of nine vertical lines and ten horizontal ones, divided by the “River of Chu and Han” in the center—symbolizing historical confrontation and territorial boundaries.",
            "Each player commands a set of sixteen pieces, colored red or black, representing seven distinct roles: General, Advisor, Elephant, Horse, Chariot, Cannon, and Soldier. Every piece moves according to its own rules: the Chariot travels in straight lines, the Horse moves in an L-shape, the Cannon captures by leaping over a piece, and Soldiers advance steadily across the board, gaining new movement options once they cross the river. At the heart of the game lies the General; if it is checkmated, the match ends instantly.",
            "Xiangqi is more than a contest of skills—it is a discipline of patience, foresight, and subtle strategy. Over centuries, a wide variety of openings and endgame patterns have emerged, elevating the game into an intricate art form. Though its rules are relatively easy to grasp, its depth offers endless fascination, captivating generations of players.",
            "Whether in quiet corners of city parks, where elderly masters contemplate each move in silence, or in the rapid-fire clashes of online play, Xiangqi continues to thrive with undiminished charm. In peaceful moments of stillness, one may find joy in a game of Xiangqi—even without fully knowing the rules, for the flow of play itself invites one into a world of calm tension and ancient intellect.",
            "中國象棋，又稱象棋，是一種歷史悠久的兩人對弈遊戲，廣泛流傳於華人文化圈。它起源可追溯至數千年前，承載著深厚的軍事思想與戰略智慧。棋盤為九宮八道，共有九條直線與十條橫線，中央以「楚河漢界」分隔敵我，象徵歷史上的對峙與對抗。",
            "每位玩家分別操控紅或黑兩方，各有十六枚棋子，包含將（帥）、士（仕）、象（相）、馬、車、炮與兵（卒）等七種角色。每種棋子都有獨特的移動方式與職能，如車可橫直疾行、馬走日字、炮需隔子攻擊，而兵則逐漸向敵陣推進，過河後方得橫行。將（帥）則是全局之核心，若被將死，遊戲即宣告結束。",
            "中國象棋不僅是技巧與智慧的較量，更蘊含著謀略與忍耐的哲學。在長久的歷史中，象棋發展出多樣的開局套路與殘局變化，使其成為一門深奧的藝術。雖然規則簡潔明瞭，但其中的變化與精妙，使無數對弈者流連忘返，樂在其中。",
            "無論是街頭巷尾的老者靜坐對弈，還是線上棋盤中的快節奏交鋒，象棋始終保持著它的魅力與生命力。在平靜時光中與人對弈，或許你不需全懂規則，便能從一子一子的運籌帷幄中，感受到這場古老遊戲所傳遞的靜謐與張力。"
        ]
    },
    {
        "Title": "NuNu",
        "URL": "",
        "Classification": "High-Mountain Tea",
        "Image": "/HighMountainTea/IntoxicatedChild.png",
        "Promotional": [
            "--",
            "--"
        ],
        "Description": [
            "--",
            "--"
        ]
    }
]